{"0": "; Type: Rug; Product Name: Contemporary Floral; Product Description: A contemporary floral rug is a type of rug that features a modern design with floral patterns. These rugs often have bold and vibrant colors and use abstract or stylized versions of traditional floral motifs. They are commonly used to add a touch of elegance and warmth to modern living spaces, and can be made from a variety of materials including wool, silk, or synthetic fibers.; Price: 221999.0; URL: https://shamojee.pk/products/contemporary-floral", "1": "; Type: Rug; Product Name: Abstract Art; Product Description: The blue-colored Turkish abstract art rug by Shamo Jee is a stunning piece of textile art that showcases intricate patterns and bold colors. The rug features a striking combination of various shades of blue that blend seamlessly to create a mesmerizing visual effect. The abstract design adds a touch of modernity to the traditional Turkish rug-making technique, making it a perfect fit for contemporary interior design styles. Crafted with meticulous attention to detail, this rug is not only a functional home decor item but also a work of art that will elevate any living space. Rug Size: 4x6 Feet; Price: 22910.0; URL: https://shamojee.pk/products/abstract-art-rug", "2": "; Type: Sofa Sets; Product Name: Firdaus Ashiyani; Product Description: Firdaus Ashiyani combines high-end style with luxury and storage. Carved from superior quality wood and beautifully styled with a high-end embossed finish, it gives your decor a royal appearance. Royal and classy are only two of many words that describe this wonderful piece. It has a stunning contrast of black antique with a golden base color. The elegant legs give it a beautiful aesthetic and provide unparalleled comfort. Firdous Ashiyani offers your decor a majestic feel that brings life to your room. It is made with a high-quality long-lasting fabric. Enrich the look of your living area with this classily build sofa.This Sofa Set includes: 3 Seater Sofa, 2 Seater Sofa, 2x1 Seater Sofas, 1 Centre Table, and 2 Side Tables.; Price: 520000.0; URL: https://shamojee.pk/products/firdaus-ashiyani", "3": "; Type: Decor; Product Name: The Dusk; Product Description: This ornamental tray features a mystical dark matte finish. The dark colour of the tray and the matte finish create a sophisticated and elegant look. It's perfect for displaying your favourite trinkets and accessories, or for use as a catchall for keys and other small items. And one cannot miss the victorian touches on the handles and the base of this bowl like tray.; Price: 4200.0; URL: https://shamojee.pk/products/nt-9t-8060", "4": "; Type: Decor; Product Name: Reindeer Jar with Golden Inserts; Product Description: Looking for a statement piece to add to your home decor collection? Our table-top jar is the perfect choice. This beautiful jar features a metallic bluish hue with golden cracks that resemble intricate inserts. The jar's lid is adorned with a stylish miniature reindeer, adding a whimsical touch to the piece. Measuring about 15cm in height, this jar is the perfect size to display on a coffee table or shelf. Its unique design and attention to detail make it a standout piece that is sure to impress any guest. Crafted from high-quality materials, this jar is both beautiful and durable, ensuring it will last for years to come. Whether you're looking for a decorative piece or a functional jar to store small items, this table-top jar is a must-have for your home decor collection.; Price: 2730.0; URL: https://shamojee.pk/products/1m-9t-9962", "5": "; Type: Curtain Fabric; Product Name: Starry Night; Product Description: Reminiscent of the painting by Vincent Van Gogh our starry night is no less than a modern masterpiece. The dark hues remind one of starry night.; Price: 0.0; URL: https://shamojee.pk/products/starry-night", "6": "; Type: Decor; Product Name: The Poseidon; Product Description: The Poseidon is a regal and elegant miniature statue of a horse with attached horse tack, standing tall on a golden rocky base. The statue is finished in a lustrous golden hue and exudes a sense of majesty and grace, making it a perfect addition to any home decor.; Price: 2925.0; URL: https://shamojee.pk/products/it-xl-201001-9bj", "7": "; Type: Prayer Mats; Product Name: Sajjadah 3; Product Description: Islam requires its worshippers to pray in a clean and segregated environment. It all started with the Prophet Mohammed (SAW), who worshipped on \"khumrah,\" a palm frond-covered mat. A prayer rug provides both of these benefits, and as a result, it is now one of the most prized possessions in any Muslim home. Our prayer mats are both thick and large, allowing Muslims to have a more pleasant salat experience. They also have a very attractive design because of the gleaming and gold-like techniques inherited from ancient Islamic Heritage. When you couple this with our prayer mat's softness, you get a namaz mat that is guaranteed to impress. It comes in a variety of attractive colors and is the ideal gift for Eid or Ramadan.; Price: 0.0; URL: https://shamojee.pk/products/sajjadah-3", "8": "; Type: Decor; Product Name: Victorian Ash; Product Description: This ash-colored vase is designed in the Victorian style, with intricate floral patterns on a plateÂ embedded on the vase that will add a touch of classic elegance to any room. The vase is perfect for holding a small bouquet of flowers, or as a standalone decorative piece. The set features 2 vases and a standing decorative plateÂ featuringÂ the consistent floral patterns with a matte ash-coloured finish.; Price: 7620.0; URL: https://shamojee.pk/products/victorian-ash", "9": "; Type: Decor; Product Name: Falling Gold; Product Description: This cylindrical ornament set has a sleek texture and shiny finish in a golden hue. It's perfect for adding a touch of luxury to any room. The shiny finish on these 3 jar-like art pieces catches the light beautifully and creates a mesmerizing effect. It can be placed on a mantel or table for display.; Price: 10000.0; URL: https://shamojee.pk/products/falling-gold", "10": "; Type: Curtain Fabric; Product Name: Cerulean; Product Description: Transform your windows into a work of art with our Glowing Cerulean floral curtains. The eye-catching design features a colorful array of blooms that brighten up any space.; Price: 0.0; URL: https://shamojee.pk/products/cerulean", "11": "; Type: Decor; Product Name: The Deer's Burden; Product Description: Introduce an element of color and style to your home decor with 'The Deer's Burden' tray set from Shamo Jee. The sleek and modern design features a matte black finish with golden reindeer models on two legs, adding a touch of sophistication to your decor. The set comes with two golden bird miniatures, adding a playful yet elegant element to the overall design. Perfect for serving snacks or displaying small items, this tray set is both functional and stylish.; Price: 3940.0; URL: https://shamojee.pk/products/nagina", "12": "; Type: Decor; Product Name: Ocean Beauty; Product Description: The 'Ocean Beauty' ceramic vase jar from Shamo Jee is a stunning addition to any home decor. This 50 cm tall vase has a victorian style design with a vintage finish in a light blue hue, adorned with intricate white feathery art on its body. The vase's handles and base are finished in a brassy golden fashion, adding a touch of elegance and sophistication to the overall look. Perfect for displaying fresh flowers or simply as a standalone piece, this vase is a true embodiment of oceanic beauty.; Price: 5200.0; URL: https://shamojee.pk/products/image-3387", "13": "; Type: Decor; Product Name: Beijing Brass; Product Description: This beautiful ceramic jar set by Shamo Jee features a sleek and modern design, with a brass lid that adds a touch of elegance and sophistication. The jars are perfect for storing and displaying small items such as spices, trinkets, or other decorative items. The smooth glaze of the ceramic adds a sleek and polished look to any room, while the brass lid adds a touch of warmth and luxury. This set is a stunning addition to any kitchen or living space, and is sure to be a conversation starter.; Price: 18000.0; URL: https://shamojee.pk/products/beijing-brass", "14": "; Type: Rug; Product Name: Geometric Fusion; Product Description: A vintage-styled geometric fusion rug is a floor covering that combines elements of traditional and modern design. It typically features bold geometric patterns and shapes, such as triangles or diamonds, arranged in a repeating pattern. The vintage style may be reflected in the color palette, which often includes muted, earthy tones like beige, brown, and gray, as well as faded or distressed areas for a worn-in look. Overall, this type of rug can add a touch of sophistication and visual interest to any room while still maintaining a classic, timeless feel.; Price: 23999.0; URL: https://shamojee.pk/products/geometric-fusion", "15": "; Type: Decor; Product Name: The Police Ride; Product Description: Add a touch of retro charm to your home with our small vintage police bike. Measuring 20cm in length and finished in a classic off-white colour, this bike is the perfect addition to any room. Crafted from high-quality metal, this piece is not only beautiful but also sturdy and durable. Its intricate detailing, including the iconic police badge on the front, make it a true standout piece that is sure to start conversations. Whether you're a fan of vintage police memorabilia or just appreciate unique decor, this small metal police bike is a must-have for your collection.; Price: 4810.0; URL: https://shamojee.pk/products/im-9t-h0042", "16": "; Type: Decor; Product Name: The Vintage Locomotive (Red); Product Description: Add a touch of vintage charm to your living space with our small metal train. Measuring 30cm in length and finished in a rich dark red colour, this train is the perfect addition to any shelf or tabletop. Crafted from high-quality metal, this piece is not only beautiful but also sturdy and durable. Its intricate design and attention to detail make it a true standout piece that is sure to start conversations. Whether you're a lover of trains or just appreciate vintage decor, this small metal train is a must-have for your collection.; Price: 6500.0; URL: https://shamojee.pk/products/im-9t-8031", "17": "; Type: Sofa Sets; Product Name: Amir al-Umara - The Noble of Nobles; Product Description: White rosewood sofa set with side and center tables. It is a complete sofa set collection for your living space with a hand-carved center table and side tables designed for comfort and long-lasting luxury! Serenity at its best. Our furniture is crafted with hard work, care, and long-lasting luxury in mind!; Price: 520000.0; URL: https://shamojee.pk/products/amir-al-umara-the-noble-of-nobles", "18": "; Type: Decor; Product Name: Nordic Ocean Birds Set; Product Description: Introducing our elegant table-top set of three great egret like birds, the Nordic Ocean Birds Set, perfect for adding a touch of sophistication and charm to any room in your home. Each bird features a beautiful golden body and crystallized wings, catching the light and sparkling beautifully. The birds are perched on top of a white marble base, adding a sense of grandeur and luxury to this already stunning piece. Measuring approximately 30cm in height, this set is the perfect size to display on a console table, mantlepiece, or even a bookshelf. The high-quality craftsmanship and attention to detail ensure that this piece is not only beautiful but also durable and long-lasting. Bring a touch of natural beauty and elegance into your home with our exquisite table-top set of two great egret like birds.; Price: 75000.0; URL: https://shamojee.pk/products/ra-9t-ra-54", "19": "; Type: Decor; Product Name: Harley Davidson; Product Description: Looking for a unique piece to add to your home decor? Look no further than our vintage metal bike. Measuring 20cm in length and featuring a sleek design inspired by classic Harley Davidson bikes, this piece is the perfect addition to any room. Crafted from high-quality metal and finished in a beautiful off-white colour with red accents, this bike is not only beautiful but also sturdy and durable. Its intricate detailing and attention to craftsmanship make it a standout piece that is sure to be a conversation starter. Whether you're a fan of motorcycles or just appreciate vintage decor, this small metal bike is a must-have for your collection.; Price: 8060.0; URL: https://shamojee.pk/products/im-9t-1959", "20": "; Type: Sofa Sets; Product Name: Khashab - Wood; Product Description: As the Arabic name suggests; polished wood is used to produce this beautifully luxurious piece of furniture that'll give your room a modern and rich look.; Price: 800000.0; URL: https://shamojee.pk/products/khashab-wood", "21": "; Type: Decor; Product Name: Golden Birds Triplet; Product Description: Looking for a charming and unique piece to add to your home decor collection? Check out our set of three little bird figurines, finished in a beautiful brassy golden color. Each bird is crafted in exquisite detail, resembling new-born chickens sitting side by side. Measuring about 10cm in length, this set is the perfect size to add a touch of personality and whimsy to any room. Whether you display them on a bookshelf, mantel, or tabletop, these little bird figurines are sure to bring a smile to your face and brighten up your space. Crafted from high-quality materials, these figurines are not only beautiful but also durable and long-lasting. Don't miss out on this charming set - it's a must-have for any nature lover or bird enthusiast.; Price: 975.0; URL: https://shamojee.pk/products/9t-xl-17687", "22": "; Type: Decor; Product Name: The Chinese Ornate; Product Description: Introducing 'The Chinese Ornate', a set of two elegant round trays from Shamo Jee. The trays are designed with a glossy black finish and intricate golden patterns, inspired by the Chinese design language. These trays are perfect to serve snacks or drinks in style and add an oriental touch to any space.; Price: 4225.0; URL: https://shamojee.pk/products/it-1815-10", "23": "; Type: Curtain Fabric; Product Name: Dutch White; Product Description: Bring a touch of luxury to your home with our Dutch White curtains with Gold Geometric patterns. The neutral shade and stylish design add a touch of sophistication to any room.; Price: 0.0; URL: https://shamojee.pk/products/dutch-white", "24": "; Type: Decor; Product Name: The Marble Stairway; Product Description: Introducing 'The Marble Stairway' - a set of three elegant candle holders crafted from smooth white marble. This set features three sleek cuboid candle holders of increasing height, resting on a matching marble tray. With three included scented candles, this set creates a peaceful and serene atmosphere in any room. The perfect addition to your home decor collection.; Price: 14495.0; URL: https://shamojee.pk/products/ra-9t-10015", "25": "; Type: Decor; Product Name: Red Vintage Car; Product Description: Introducing our funky and stylish small model car, inspired by the classic vintage cars of the mid-20th century. Measuring about 20cm in length and finished in a vibrant red colour, this piece is the perfect way to add a pop of colour and retro charm to any room. Crafted from high-quality metal, this model car is not only beautiful but also sturdy and durable. Its attention to detail and intricate design make it a true standout piece that is sure to impress any guest. Whether you're a fan of vintage cars or just appreciate unique decor, this small metal model car is a must-have for your collection. Add it to your bookshelf, desk, or tabletop for an instant touch of style and personality.; Price: 6695.0; URL: https://shamojee.pk/products/1m-9t-8043", "26": "; Type: Sofa Sets; Product Name: Mushk-e-Kafoor; Product Description: Muskh-e-Kafoor is manufactured with great care and precision from high-quality Sheesham wood. It has an antique golden glossy finish and a beige cream-colored fabric. The soft fabric and rounded arms offer a classic style that complements any theme. Mushk e Kafoor also includes a center table and two complimentary side tables. These stylish tables will add elegance and functionality to any room where they are placed. Each piece is made with high-quality resources and long-lasting material to provide decades of comfort. We make it simple to transform a mundane setting into something extraordinary.; Price: 850000.0; URL: https://shamojee.pk/products/mushk-e-kafoor", "27": "; Type: Decor; Product Name: Ceramic Pineapple Set; Product Description: The Shamo Jee Ceramic Pineapple Set Ornament is a beautifully crafted decorative piece, perfect for adding a touch of tropical charm to any home or office space. Made from high-quality ceramic material, this set of pineapple ornaments features intricate details and a glossy finish, making it both durable and visually appealing. The charming design, featuring a classic pineapple shape, symbolizes hospitality, warmth and welcome, making it an ideal gift for a housewarming or hostess. Whether used for display on a shelf, mantelpiece, or table, this set of ornaments is sure to bring a smile to anyone who sees it. Overall, the Shamo Jee Ceramic Pineapple Set Ornament is a must-have for anyone who loves tropical-inspired decor.; Price: 3180.0; URL: https://shamojee.pk/products/ceramic-pineapple-set", "28": "; Type: Decor; Product Name: The Golden Leaflet; Product Description: Introducing our stunning table-top ornament, a golden leaf that is the perfect addition to any interior decor. Inspired by the beautiful money plant, this exquisite ornament is expertly crafted with a realistic design and a lustrous golden finish. It measures 10 cms in length and will make a stunning statement piece on any table or shelf. The leaf's natural curves and fine detailing will add a touch of elegance and sophistication to any space. It is the perfect choice for nature enthusiasts or anyone who appreciates unique and artistic decor. Bring a little bit of nature indoors with this beautiful golden money plant leaf ornament from Shamo Jee.; Price: 2015.0; URL: https://shamojee.pk/products/im-9t-14w27-2", "29": "; Type: Decor; Product Name: The Horse Above the Solid; Product Description: The 'Horse above the solid' art piece from Shamo Jee is a stunning decorative piece for any modern interior. The piece features a beautifully crafted 2-D golden metallic horse head atop a matte black cubical base. The minimalistic yet elegant design of the piece makes it a perfect addition to any modern home decor.; Price: 8970.0; URL: https://shamojee.pk/products/ra-9t-1005", "30": "; Type: Decor; Product Name: Victorian Bloom; Product Description: This set of 2 matte pink-colored vases are designed in the Victorian style, with playful floral patterns that will add a touch of charm to any room. This vase set of 2 is perfect for holding a small bouquet of flowers, or as a standalone decorative piece.; Price: 17000.0; URL: https://shamojee.pk/products/victorian-bloom", "31": "; Type: Decor; Product Name: Victorian Sky; Product Description: This light blue vase is designed in the Victorian style, with playful floral patterns that will add a touch of charm to any room. The vase is perfect for holding a small bouquet of flowers, or as a standalone decorative piece. The royal blue color gives it a touch of uniqueness.; Price: 5400.0; URL: https://shamojee.pk/products/victorian-sky", "32": "; Type: Decor; Product Name: The Golden Jardiniere; Product Description: Introducing the Golden Jardiniere from Shamo Jee, a stunning cylindrical vase that stands tall at a foot long. Its matte black finish creates a bold base for the glossy golden inserts, adding an element of luxury and sophistication to any interior decor. Whether used to display fresh flowers or as a statement piece on its own, this vase is sure to elevate any living space.; Price: 4875.0; URL: https://shamojee.pk/products/ra-9t-92090", "33": "; Type: Decor; Product Name: Reindeer Jar; Product Description: Transform your home decor with our stunning table-top jar in a metallic turquoise hue. This jar is perfect for adding a pop of color and style to any space. It features intricate golden inserts that add depth and texture to the jar's unique design. The lid of the jar is adorned with a stylish miniature reindeer, making it a perfect addition to your holiday decor. Measuring about 15cm in height, this jar is the perfect size to display on a coffee table or shelf. Its high-quality craftsmanship ensures that it is both beautiful and durable, so you can enjoy it for years to come. Whether you use it to store small items or display it as a standalone decorative piece, our table-top jar is sure to become a favorite in your home.; Price: 2210.0; URL: https://shamojee.pk/products/1m-9t-9961", "34": "; Type: Curtain Fabric; Product Name: Feldgrau; Product Description: Transform your windows into a work of art with our Feldgrau curtains with paisley inlay. The eye-catching design adds a touch of exotic charm to any room.; Price: 0.0; URL: https://shamojee.pk/products/feldgrau", "35": "; Type: Sofa Sets; Product Name: Rashk-e-Laala; Product Description: The question of what you want to own is actually the question of how you want to live your life. The Rashk-e-Laala consists of: 3 Seater Sofa, 2x1 Seater Sofas, 1 Side Table, and 1 Center Table. A beautiful blend of keekar and sheesham wood, fully upholstered with a soft fabric and finished with a matte lacquer, the Rashk-e-Laala is the what dreams are made of.; Price: 850000.0; URL: https://shamojee.pk/products/rashk-e-laala", "36": "; Type: Decor; Product Name: The Stag's Vessel; Product Description: Introduce an edgy flair to your home decor with 'The Stag's Vessel' by Shamo Jee. This small yet stunning decorative jar features a sleek matt black finish and a beautifully detailed golden 3D reindeer head with large antlers embedded on the surface. Use it as a statement piece on a shelf or to store small trinkets on your vanity.; Price: 12090.0; URL: https://shamojee.pk/products/nt-9t-8059", "37": "; Type: Curtain Fabric; Product Name: Autumn Bisque; Product Description: Transform your windows into a scenic view with our Bisque leaf Organza. The rich, warm hues and intricate leaf design create an inviting ambiance in any room. Fabric Length: 3 Yards.; Price: 0.0; URL: https://shamojee.pk/products/autumn-bisque", "38": "; Type: Curtain Fabric; Product Name: Ice Berg; Product Description: Embrace the beauty of nature with our Iceberg coloured curtains featuring a stunning leaf pattern. The high-quality design adds a touch of freshness to any living space.; Price: 0.0; URL: https://shamojee.pk/products/ice-berg", "39": "; Type: Decor; Product Name: The Antique Hexagons; Product Description: Elevate your home decor with our stunning small metal jar. Measuring 7cm in height and finished in a beautiful brassy silver colour, this jar is the perfect addition to any room. Its intricate hexagonal patterns on the outside add a touch of elegance and sophistication, while the curvy lid handle at the top provides easy access to its contents. Crafted from high-quality metal, this jar is not only beautiful but also durable and long-lasting. Whether you use it to store small trinkets or as a decorative accent on a shelf or tabletop, this small metal jar is a must-have for anyone looking to add a touch of glamour to their interior design.; Price: 3802.5; URL: https://shamojee.pk/products/nagina-7109", "40": "; Type: Decor; Product Name: Oval Embellishment; Product Description: Introducing the 'Oval Embellishment' - a majestic decor piece that is sure to elevate your living space! Standing tall at 5 feet, this stunning item features a round oval container with intricate and abstract royal designs on the surface. The container is supported by three legs finished in a luxurious coppery golden hue, giving it a regal look. Perfect for adding a touch of sophistication to any room, this item is sure to be a conversation starter!; Price: 20605.0; URL: https://shamojee.pk/products/item-no-81252", "41": "; Type: Decor; Product Name: The Small Antique Hexagons; Product Description: Looking for a chic and stylish way to organize your space? Our small metal jar is just what you need. Measuring 10cm in height and finished in a gorgeous brassy silver colour, this jar is the perfect blend of vintage and modern style. Its intricate hexagonal patterns on the outside add a unique touch, while the curvy lid handle at the top provides easy access to its contents. Crafted from high-quality metal, this jar is not only beautiful but also sturdy and durable. Whether you use it to store small trinkets or as a decorative accent on a shelf or tabletop, this small metal jar is a must-have for any home decor enthusiast.; Price: 3152.5; URL: https://shamojee.pk/products/nagina-7110", "42": "; Type: Curtain Fabric; Product Name: White Summer; Product Description: Introducing the White Shimmer curtains, the perfect addition to any modern or contemporary living space. The shimmering white fabric adds a touch of elegance to your home decor.; Price: 0.0; URL: https://shamojee.pk/products/white-summer", "43": "; Type: Decor; Product Name: Candlestick Telephone; Product Description: Introducing the vintage Candlestick Telephone (an analogue telephone), a timeless piece of royalty that will transport you back in time. This beauty features a rich dark maroon color with touches of wooden accents that add a touch of class to any home decor. The circular dial allows you to manually dial your numbers with ease, while the metal dial displays intricate design patterns that add a touch of sophistication to this retro phone. A true collector's item, this vintage telephone is sure to turn heads and spark conversation.; Price: 10725.0; URL: https://shamojee.pk/products/nagina-5082", "44": "; Type: Decor; Product Name: The Floating Leaf; Product Description: The Floating Leaf is a stunning set of two round decorative trays from Shamo Jee. The trays feature a glossy black finish and are adorned with a beautiful golden elongated leaf pattern in the middle base. Perfect for displaying decorative items or for serving guests, these trays add an elegant touch to any room.; Price: 4225.0; URL: https://shamojee.pk/products/it-1815-6", "45": "; Type: Decor; Product Name: The Japanese Vessel; Product Description: The 'Japanese Vessel' by Shamo Jee is a stunning half-foot jar that exudes elegance and sophistication. With a lustrous golden finish and intricate white floral patterns adorning its surface, it captures the essence of Japanese design language. Perfect as a decorative accent or to store small items, this vessel is sure to add a touch of luxury to any space.; Price: 8775.0; URL: https://shamojee.pk/products/1m-9t-200i", "46": "; Type: Sofa Sets; Product Name: Dabiir-ul-Mulk - The Boxed Modern Sofa; Product Description: Your home should be a story of who you are, and be a collection of what you love! The Dabiir-ul-Mulk consists of: 3 Seater Sofa, 2 Seater Sofa, 2x1 Seater Sofas, and 1 Center Table. This beautiful piece of artistry is crafted with love and care from solid wood, covered with a plush imported fabric and filled with molty flex-foam to bring comfort and sophistication together. The table is made of 18 gauge brass and is completed with a marble top for an elegant look.; Price: 595000.0; URL: https://shamojee.pk/products/dabiir-ul-mulk-the-boxed-modern-sofa", "47": "; Type: Decor; Product Name: The Golden Clover; Product Description: \"The Golden Clover\" is a unique decorative piece by Shamo Jee. This abstract design ornament features a round golden clover-shaped piece mounted on a sleek black rectangular base. Its minimalist design and exquisite golden finish add a touch of elegance to any space, making it a perfect addition to any interior decor.; Price: 7800.0; URL: https://shamojee.pk/products/ra-9t-10045", "48": "; Type: Chair Sets; Product Name: The Victorian Epiphany; Product Description: Shamo Jee is offering exclusively designed 2 seater sofa set including table pieces - The Victorian Epiphany. This is a pure wood furniture with velvet clothing and matte gold finish that is sure to turn heads at your home, office, or living space. For commissioning, ordering, and buying, contact Shamo JeeÂ® Furnitures. Halfway between the original design and superior quality, luxury furniture like all of the furniture offered atÂ Shamo JeeÂ is not only comfortable but also especially beautiful to look at. It gives a sense of spaciousness as well as the appearance of a luxury lifestyle. WeÂ combine high end furniture materials with creative styles that make them simply unique. Whether it's a bed base, a leather sofa, a solid wood dining table, or a sideboard, every piece of furniture can be a piece of luxury. If youâ€™re looking for valuable furniture for your home,Â Shamo Jee is the perfect partner to use with our used luxury furniture at our luxury furniture warehouse. With their exclusive selection, you will find everything that fits your luxury furniture needs.; Price: 250000.0; URL: https://shamojee.pk/products/the-victorian-epiphany", "49": "; Type: Sofa Sets; Product Name: Paaya-e-Takht - The Central Throne; Product Description: Royalty deserves a Throne. And, it is not materialists that conform to the definition of Royals but idealists who are humble in their approach. If you have such an approach of pursuing ideas, The Central Throne can specially be commissioned for you from The House of Shamo Jee! It has the perfect balance of artistic idealism with elements of subtlety and humbleness. A combination ever so perfect to deserve your and your loved ones resting on it. The stitched and patterned silk rests on top of an intricately refined wood base. The wood base itself flaunts edges that remind of royal yet subtle curves and entangled circular abstracts. In such a setting, there has been a careful invention of the following articles of art in this furniture set: 3 Seater Sofa, 2x1 Seater Sofas, 1 Side Table, and 1 Center Table. So not a singly done Throne, but a whole package for you to subconsciously feel the combined bomb of the following ethos: art, royalty, idealism, comfort, and humility.; Price: 950000.0; URL: https://shamojee.pk/products/paaya-e-takht-the-central-throne", "50": "; Type: Prayer Mats; Product Name: Sajjadah 2; Product Description: Islam requires its worshippers to pray in a clean and segregated environment. It all started with the Prophet Mohammed (SAW), who worshipped on \"khumrah,\" a palm frond-covered mat. A prayer rug provides both of these benefits, and as a result, it is now one of the most prized possessions in any Muslim home. Our prayer mats are both thick and large, allowing Muslims to have a more pleasant salat experience. They also have a very attractive design because of the gleaming and gold-like techniques inherited from ancient Islamic Heritage. When you couple this with our prayer mat's softness, you get a namaz mat that is guaranteed to impress. It comes in a variety of attractive colors and is the ideal gift for Eid or Ramadan.; Price: 0.0; URL: https://shamojee.pk/products/sajjadah-2", "51": "; Type: Decor; Product Name: The Maze; Product Description: Maze Vase: This set of 3 white and black vases is designed with a black line pattern that creates a maze-like design. The vase is perfect for displaying a bouquet of flowers or as a standalone decorative piece. The black lines give a unique and modern touch to the vase.; Price: 19800.0; URL: https://shamojee.pk/products/the-maze", "52": "; Type: Decor; Product Name: The Gilded Prongs; Product Description: Introducing 'The Gilded Prongs' - an eye-catching abstract design ornament from Shamo Jee. Its sleek matte black cubical base is accentuated by the glossy golden round prongs that emerge from the top in a unique and intriguing pattern. This statement piece is perfect for adding a touch of modernity and sophistication to any space.; Price: 7995.0; URL: https://shamojee.pk/products/ra-9t-6323", "53": "; Type: Decor; Product Name: Constellation Orbs; Product Description: The Shamo Jee \"Constellation Orbs\" Ornament is a unique and elegant decorative piece, featuring a brass stand and a spherical mirror. The brass stand is expertly crafted with a warm, gold-toned finish and intricate details, offering both durability and timeless beauty. The spherical mirror is highly reflective, adding a touch of glamour and sophistication to any room. This ornament can be placed on a tabletop, mantelpiece, or shelf, and its compact size makes it a versatile and space-saving addition to any home or office. Whether used for practical purposes or simply as a decorative accent, this ornament by Shamo Jee is sure to impress.; Price: 15660.0; URL: https://shamojee.pk/products/constellation-orbs", "54": "; Type: Decor; Product Name: Lipstick Vase Set; Product Description: This set of 2 red vases have a vibrant red lipstick colour that adds a bold and striking touch to any room. The sleek design of each vase makes it perfect for displaying a bouquet of flowers or as a standalone decorative piece. It is a perfect decor vases for someone looking to add a touch of funky personality to any interior space.; Price: 2778.0; URL: https://shamojee.pk/products/lipstick-vase-set", "55": "; Type: Curtain Fabric; Product Name: KeyLime; Product Description: Liven up your space through the beauty of bright hues with our Key Lime curtains. The high-quality design adds a touch of liveliness to any living space.; Price: 0.0; URL: https://shamojee.pk/products/keylime", "56": "; Type: Decor; Product Name: Day-Break Vase Set; Product Description: Elevate your decor with this beautiful set of 3 ceramic vases from Shamo Jee. The sleek cadet gray color is beautifully accented with subtle golden spots, adding just enough sparkle to catch the eye. Perfect for holding fresh flowers or simply as a standalone decorative piece, these vases will add a touch of sophistication to any room.; Price: 22800.0; URL: https://shamojee.pk/products/day-break-vase-set", "57": "; Type: Sofa Sets; Product Name: Shahi Nashist - The Poet's Conclave; Product Description: Shamo Jee is offering exclusively designed 7 seater sofa set including table pieces - The Shahi Nashist. This is a pure wood furniture with velvet clothing and high gloss wood finish that is sure to turn heads at your home, office, or living space. For commissioning, ordering, and buying, contact Shamo JeeÂ® Furnitures. From the creamish velvet cloth texture with subtle design of rectangular abstractions to the solid foundational wood refined in a curved manner, the sofa set is anÂ epitome of material craftsmanship only exclusive to historical royals concentrated around the South Asian geography. The aesthetics of it only draws parallels from the artistic wordsÂ of the deep-sighted poets of the same region. Combine this with the intricate golden rings of focused opulence on the front facets of the set gives shape to an furniturial artwork that only a 'Shah' in nature can appreciate. Hence, presenting the 'Shahi Nashist' - The Poet's Conclave.The Shahi Nashist consists of: a 3 Seater Sofa, 2 Seater Sofa, 2x1 Seater Sofas, 1 Center Table, and 2 Side Tables. Our 'Shahi Nashist' in all its white and woodish glory is the perfect companion for your family at home. Only a Shahi family can well take up the responsibility of hosting this royal artwork of a complete 7 seater sofa set - The Shahi Nashist.; Price: 500000.0; URL: https://shamojee.pk/products/sofa-set-shahi-nashist", "58": "; Type: Sofa Sets; Product Name: Takht-e-Makhmal; Product Description: This amazing sofa set has everything you need to bring your furniture ideas to reality. It is available in a variety of colours. The sofa's classic royal-like form contributes to its sophistication and elegance, making it even more stunning. It is available in two colours: black and white. The outstanding aesthetic and physical feeling made possible by the tarnished gold legs and the ultra-comfortable molty flex foam will stay with you for a very long time. Redecorate your house and redefine your life. Creativity from the heart of the wood. This modern yet unique piece of furniture is made of white rose wood, carved with fiber glass, and finished with a high gloss. To get the final shine we treated this piece of art with hardner and compounded.; Price: 760000.0; URL: https://shamojee.pk/products/takht-e-makhmal", "59": "; Type: Decor; Product Name: Leaf Beneath the Feet; Product Description: Introducing \"Leaf Beneath the Feet,\" a stunning golden decor piece that captures the beauty of nature. Four adorable little birds sit together on a golden leaf, adding a touch of serenity to any room. The intricate detailing on the birds' feathers and the leaf makes it a true work of art. Perfect for tabletop display, this decor item will be a delightful addition to your home. Add a touch of natural elegance to your space with \"Leaf Beneath the Feet.\"; Price: 1755.0; URL: https://shamojee.pk/products/9t-xl-20386", "60": "; Type: Decor; Product Name: Versace Vase Set; Product Description: This white jar is adorned with the iconic Versace logo lookalike in gold, adding a touch of luxury to any room. Perfect for holding small items or as a standalone decorative piece. This set of 3 vases is finished in a premium glossy texture to give off a luxurious vibe synonymous to its design.; Price: 17500.0; URL: https://shamojee.pk/products/versace-vase-set", "61": "; Type: Rug; Product Name: Persian Oasis; Product Description: The Persian Oasis rug is a luxuriously soft rug made with fine, high-quality threads that give it a handmade look and feel. This type of rug is typically designed with intricate patterns and vibrant colors, inspired by traditional Persian rug designs. With its soft texture and intricate design, the Persian Oasis rug is perfect for adding a touch of elegance and warmth to any room in your home.; Price: 48999.0; URL: https://shamojee.pk/products/persian-oasis", "62": "; Type: Decor; Product Name: The White Duo; Product Description: The White Duo is an elegant and charming small figurine of two matte white horses with golden mane and tails. One horse stands majestically while the other is rearing up, adding a dynamic touch to the piece. The smooth, minimalist design and pristine color scheme make it a perfect addition to any modern interior.; Price: 3120.0; URL: https://shamojee.pk/products/it-8106", "63": "; Type: Decor; Product Name: Dry Fruit Canister; Product Description: Introducing our elegant low-heighted dry fruit canister, a perfect addition to your dining table or kitchen shelf. Crafted in a creamy off-white finish, this canister is designed to keep your dry fruits fresh and organized. With a size of 10cm in length by 10cm in width and a height of 4cm, it's the ideal size for any table setting. The simple yet stylish design makes it a versatile piece that can complement any decor theme. Get yours today and add a touch of sophistication to your home.; Price: 3900.0; URL: https://shamojee.pk/products/nt-9t-8075", "64": "; Type: Decor; Product Name: The Bird's Pillar; Product Description: Introducing \"The Bird's Pillar\" - a striking 20cm tall cylindrical jar that exudes elegance and style. The jar is finished in a metallic glossy black finish with stunning dull golden crack inserts, adding a touch of glamour to any room. The jar is completed with a quirky and unique lid, featuring two golden bird-like statues which are used to open the jar. A true statement piece that is sure to impress all who see it.; Price: 3500.0; URL: https://shamojee.pk/products/image-3422", "65": "; Type: Curtain Fabric; Product Name: Cadmium Bistre; Product Description: Bring a touch of botanical beauty to your home with our Cadmium-coloured floral curtains. The vibrant design features a stunning array of blooms that add a touch of nature to any room.; Price: 0.0; URL: https://shamojee.pk/products/cadmium-bistre", "66": "; Type: Chair Sets; Product Name: Gul Andaam; Product Description: Every room requires a touch of black. The simple yet classy design of this modern accent chair makes it ideal for relaxing after a long day at work. It is designed with 18 gauge brass, with plenty of floor space for easy cleaning. This sofa chair is made of strong Brass legs treated with lacquer to stop rusting. The highlights of this collection are its ample solace and sleek accents. Dust and debris can be wiped away using a clean damp cloth. It blends very well with any existing furniture and decor. The thick black fabric wraps the entire chair from the legs up. It comes with a side table with a sturdy frame that can easily carry your tea, newspapers, drinks, and refreshments. Bumping up would not hurt you because of the sleek top and round edges. This Chair Set includes 2 chairs and 1 three-leg artisan table.; Price: 120000.0; URL: https://shamojee.pk/products/gul-andaam", "67": "; Type: Decor; Product Name: The Glory; Product Description: This ornament is designed in the shape of a horse head and features a rustic finish. The combination of the horse head shape and a rustic finish makes it a perfect fit for any farmhouse or rustic-style decor. Hang it on a fireplace mantel or bookshelf for a touch of rustic charm.; Price: 2670.0; URL: https://shamojee.pk/products/the-glory", "68": "; Type: Decor; Product Name: White Vintage Car; Product Description: Looking for a unique piece to add to your home decor collection? Check out our small model car, inspired by the classic vintage cars of the mid-20th century. Measuring about 20cm in length and finished in a timeless off-white colour, this piece is the perfect way to add a touch of retro charm to any room. Crafted from high-quality metal, this model car is not only beautiful but also sturdy and durable. Its attention to detail and intricate design make it a true standout piece that is sure to impress any guest. Whether you're a fan of vintage cars or just appreciate unique decor, this small metal model car is a must-have for your collection. Add it to your bookshelf, desk, or tabletop for an instant touch of style and sophistication.<br data-mce-fragment=\"1\">; Price: 7800.0; URL: https://shamojee.pk/products/1m-9t-8039", "69": "; Type: Sofa Sets; Product Name: Gul-e-Roshan; Product Description: Gul-e-Roshan is the ideal complement to any living room that wants to deliver a touch of antiquity. The chosen fabric is of great quality and has been developed to last a long time. The pure Sheesham wood body with a high gloss finish treated with hardener offers great stability and consistency. The cushion is made of high-resilience foam that will provide you with excellent support. It will quickly become your new favourite corner in the house. Gul e Roshan includes a centre table and two side tables to give your home a more high-class vibe. This simple table set is viable while also creating a strong modern ambiance.; Price: 750000.0; URL: https://shamojee.pk/products/gul-e-roshan", "70": "; Type: Rug; Product Name: Midnight Splendor; Product Description: Add a touch of opulence to your living space with our Midnight Splendor vintage rug. The combination of deep black and shimmering gold creates a dramatic effect, while the intricate design and aged patina give it a unique character. Made with quality materials and craftsmanship, this rug is not only stylish but also durable and easy to maintain. Perfect for elevating any room in your home with a hint of vintage glamour.; Price: 24499.0; URL: https://shamojee.pk/products/midnight-splendor", "71": "; Type: Decor; Product Name: The Ivory Slate; Product Description: Introducing the 'The Ivory Slate' tray from Shamo Jee, a luxurious addition to your interior decor. This medium-sized tray boasts a premium black and grayish marble finish, exuding elegance and sophistication. The glossy texture adds a touch of refinement and is sure to catch the eye of anyone who lays their gaze upon it. The tray features metallic handles on both sides, making it easy to carry and perfect for serving refreshments or displaying decorative items. Add a touch of class to your home with the 'Ivory Slate' tray.; Price: 7670.0; URL: https://shamojee.pk/products/ra-9t-w007", "72": "; Type: Prayer Mats; Product Name: Sajjadah 1; Product Description: Islam requires its worshippers to pray in a clean and segregated environment. It all started with the Prophet Mohammed (SAW), who worshipped on \"khumrah,\" a palm frond-covered mat. A prayer rug provides both of these benefits, and as a result, it is now one of the most prized possessions in any Muslim home. Our prayer mats are both thick and large, allowing Muslims to have a more pleasant salat experience. They also have a very attractive design because of the gleaming and gold-like techniques inherited from ancient Islamic Heritage. When you couple this with our prayer mat's softness, you get a namaz mat that is guaranteed to impress. It comes in a variety of attractive colors and is the ideal gift for Eid or Ramadan.; Price: 0.0; URL: https://shamojee.pk/products/sajjadah-1"}